# Используем минимальный образ Python 3.11
FROM python:3.11-slim

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем только файлы, необходимые для установки зависимостей
COPY requirements.txt /app/

# Устанавливаем зависимости перед копированием кода (чтобы кешировался слой)
RUN pip install --no-cache-dir -r requirements.txt

# Копируем весь код проекта
COPY . /app/

# Используем переменные окружения для конфиденциальных данных
ENV TOKEN=${TOKEN}

# Запускаем бота
CMD ["python", "bot.py"]
